brew "asdf"
brew "bat"
brew "fd"
brew "fswatch"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "htop"
brew "java"
brew "jq"
brew "just"
brew "lcov"
brew "lsd"
brew "mackup"
brew "mas"
brew "multi-git-status"
brew "pidof"
brew "pinentry-mac"
brew "plantuml"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "sd"
brew "starship"
brew "tldr"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "yq"

cask "bruno"
cask "cursor"
cask "docker"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "ghostty"
cask "keeper-password-manager"
cask "obsidian"
cask "ollama"
cask "raycast"
cask "swiftbar"
cask "visual-studio-code"
cask "windsurf"
