tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
cask_args appdir: "~/Applications"

brew "asdf"
brew "bat"
brew "exa"
brew "fswatch"
brew "git"
brew "gnupg"
brew "jq"
brew "lcov"
brew "mackup"
brew "mas"
brew "multi-git-status"
brew "pinentry-mac"
brew "plantuml"
brew "pyenv"
brew "pyenv-virtualenv"
brew "yq"
brew "zplug"

cask "bitwarden"
cask "devonthink"
cask "docker"
cask "font-fira-code"
cask "google-chrome"
cask "google-backup-and-sync"
cask "iterm2"
cask "notion"
cask "obsidian"
cask "raycast"
cask "slack"
cask "spotify"
cask "viscosity"
cask "visual-studio-code-insiders"

mas "Things 3", id: 904280696
